#include <stdio.h>

int main(void)
{
    int N = 8;
    int K = 2;
    int n = 4;
    int L = 337;
    int k = 5;
    int m = 3;
    float area = 100.0f;
    int people = 10000;

    printf("123\n");
    printf("1\n2\n3\n");
    printf("1\n\t2\n\t\t3\n");
    printf("%1d\n%3d\n%5d\n%7d\n", 1, 2, 3, 4);
    printf("%10.3f\n", 12.234657);
    printf("%10.5f\n", 12.234657);
    printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
    printf("7 / 5 = %d\n", 7 / 5);
    printf("2000 * 4 = %d\n", 2000 * 4);
    printf("%g разделить %e равно %f\n", 5., 2000000., 5. / 2000000);
    printf("%d разделить %d равно %d\n", 5., 2000000., 5. / 2000000);
    printf("%f разделить %f равно %f\n", 5., 2000000., 5. / 2000000);
    printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000);
    printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000);

    printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
    printf("Идет %d минута суток\n", N * 60 + K);
    printf("До полуночи осталось %d часов и %d минут\n",
           (24 * 60 - (N * 60 + K)) / 60,
           (24 * 60 - (N * 60 + K)) % 60);
    printf("С 8.00 прошло %d секунд\n", ((N - 8) * 60 + K) * 60);
    printf("Текущий час = %.2f суток, текущая минута = %.2f часа\n",
           N / 24.0, K / 60.0);

    printf("Деление, вариант 3: %*d / %*d\n%-+*.*f\n",
           k, n, k, L, k + m + 2, m, n / (float)L);



    printf("Плотность населения: %.2f человек на км2\n", people / area);

    return 0;
}